# Education and Youth Data set

In [20]:
import re
with open('/home/kirti/Data_sets/EducationandYouth.csv') as f:
  data = f.read().strip()
data

'Neighborhood,eattend10,eattend11,eattend12,eattend13,mattend10,mattend11,mattend12,mattend13,hsattend10,hsattend11,hsattend12,hsattend13,eenrol11,eenrol12,eenrol13,menrol11,menrol12,menrol13,hsenrol11,hsenrol12,hsenrol13,aastud10,aastud11,aastud12,aastud13,wstud10,wstud11,wstud12,wstud13,hstud10,hstud11,hstud12,hstud13,abse10,abse11,abse12,abse13,absmd10,absmd11,absmd12,absmd13,abshs10,abshs11,abshs12,abshs13,susp10,susp11,susp12,susp13,farms10,farms11,farms12,farms13,sped10,sped11,sped12,sped13,ready11,ready12,ready13,math310,math311,math312,math313,read310,read311,read312,read313,math510,math511,math512,math513,read510,read511,read512,read513,math810,math811,math812,math813,read810,read811,read812,read813,hsaeng10,hsaeng11,hsaeng12,hsaeng13,hsabio10,hsabio11,hsabio12,hsabio13,hsagov10,hsagov11,hsagov13,hsaalg10,hsaalg11,hsaalg12,hsaalg13,drop10,drop11,drop12,drop13,compl10,compl11,compl12,compl13,sclsw11,sclsw12,sclsw13,sclemp13\nAllendale/Irvington/S. Hilton,1118,1037,999,939,747,624,586,593,1064,930,862,844,965,973,920,582,568,572,852,833,807,94.9%,93.9%,93%,93.4%,2.9%,3.5%,3.9%,3.7%,0.8%,1.5%,2.1%,1.9%,14.7%,20.6%,15.6%,16.6%,28.8%,20%,14.7%,14.7%,41.2%,38.3%,39%,35.7%,9.5%,10.4%,10%,7.6%,86.1%,86.1%,79.3%,87.8%,16.9%,16.7%,17.3%,18.1%,68.4%,70.6%,88.2%,67.2%,73.5%,69.8%,64.8%,59.6%,60.9%,59.6%,63.6%,67%,55.9%,65%,59.7%,76.1%,69.2%,81%,77.5%,23.7%,27.9%,38%,37.2%,45.1%,54.4%,62.4%,60.4%,38%,34.1%,32.3%,27.5%,41%,31.2%,32.2%,30.3%,53%,46%,38.5%,19.9%,20.6%,17.9%,17.9%,3.8%,4.9%,2.7%,2.7%,80.3%,83.9%,78.1%,78.1%,6.8%,9.6%,9.6%,71%\nBeechfield/Ten Hills/West Hills,574,647,605,606,349,351,370,379,511,516,494,507,597,583,580,317,364,365,463,474,490,95.4%,95.6%,95.6%,94.5%,2.1%,2.5%,2.5%,2.9%,0.6%,1.2%,1.1%,1.5%,6.4%,17.9%,9.9%,12%,11.7%,11.1%,10.3%,10%,29.9%,31.4%,29.1%,23.7%,8.1%,6.7%,8.4%,4.9%,76.3%,77.8%,69.6%,79.1%,12.7%,12.9%,14%,14.3%,44.2%,71.8%,82.4%,76.7%,75.9%,73.6%,77%,69.9%,69.2%,73.8%,73.5%,79.8%,63.2%,74.6%,71.9%,88.3%,78.7%,80.3%,82%,29.2%,39.6%,39.8%,42.9%,56.7%,77%,66.7%,75.2%,43.6%,37.1%,36.8%,44.6%,47.6%,41.3%,45.9%,50.3%,60.1%,52.3%,53.9%,24.6%,22.7%,28.1%,28.1%,2%,1.9%,3%,3%,85.9%,80.3%,82.1%,82.1%,5.1%,5.6%,5.6%,81.1%\nBelair-Edison,1162,1241,1174,1149,831,773,746,714,1219,1178,1126,1117,1160,1141,1114,741,723,701,1084,1091,1080,96.9%,97%,96.7%,96.1%,1.3%,1.5%,1.4%,1.4%,0.3%,0.7%,1.2%,1.6%,14%,18.9%,16.8%,16.3%,12.4%,13.1%,14.9%,8.8%,41.1%,44%,41.5%,34.5%,9.9%,8.6%,8.7%,9.8%,85.5%,84.4%,78.8%,86%,16%,16.7%,17.4%,16.5%,69%,57.6%,75.3%,76.9%,68.1%,70.4%,60%,69.8%,67.7%,62.2%,57.7%,74.8%,60.3%,70.1%,59.9%,79%,69.8%,76.4%,70.9%,30.6%,44.8%,38%,38.6%,57.3%,65.6%,57.5%,60.8%,32.5%,33.4%,32.2%,30.6%,36.9%,33.7%,32.7%,36.3%,39%,40.7%,41.9%,23%,18.7%,18.6%,18.6%,4%,4.2%,3.8%,3.8%,82.9%,79.9%,77.4%,77.4%,7.2%,7.6%,7.6%,78.5%\nBrooklyn/Curtis Bay/Hawkins Point,1011,1093,997,1050,525,481,479,512,615,537,552,519,966,933,972,420,446,480,474,534,482,58.9%,58.3%,58.2%,55.8%,31.1%,31.6%,30.2%,30.3%,6.6%,8.3%,9.5%,11.9%,19.6%,19.8%,20.1%,19.1%,21.3%,24.5%,24%,25.4%,36.3%,46.9%,48.2%,39.3%,8%,6.7%,7.6%,11.4%,85.8%,88.5%,78.5%,90.5%,20.3%,18.5%,18.6%,18.2%,42.9%,84.2%,70.9%,82.4%,75.9%,78%,68.9%,74.5%,69.2%,63.2%,62%,70.8%,60.9%,63.1%,60.2%,81.2%,74%,72.5%,64.8%,32.5%,26.5%,38.1%,26.1%,56.3%,68.1%,62.8%,60.3%,39.2%,36.8%,30.9%,38.5%,45.4%,37.7%,46.2%,46.2%,55.6%,48.4%,59%,30.5%,25.5%,21.3%,21.3%,5.2%,3.5%,4.8%,4.8%,78.5%,75.4%,70.5%,70.5%,6.2%,8%,8%,91.9%\nCanton,90,76,89,84,32,37,38,39,49,37,30,29,69,82,79,32,36,35,30,26,28,19.6%,17.2%,19.1%,16.4%,59.8%,54.6%,51.3%,54.5%,17.5%,19%,21.1%,25.4%,7.8%,6.6%,6.7%,6%,21.9%,13.5%,13.2%,12.8%,22.4%,29.7%,20%,34.5%,8.5%,7.5%,3.5%,5.3%,73.5%,71%,61.8%,67.7%,17.5%,14.9%,11.6%,10.6%,84.2%,45.5%,96%,100%,75%,88.9%,80%,90%,83.3%,77.8%,80%,81.8%,50%,76.9%,83.3%,100%,71.4%,92.3%,83.3%,77.8%,66.7%,45.5%,60%,88.9%,75%,72.7%,80%,42.9%,30.8%,55.6%,60%,50%,25%,78.6%,37.5%,18.2%,63.6%,25%,39.3%,42.9%,37.5%,37.5%,4.1%,8.1%,0%,0%,75%,66.7%,100%,100%,2.7%,1.9%,1.9%,92.1%\nCedonia/Frankford,1284,1451,1425,1379,729,844,758,749,1477,1315,1251,1210,1309,1337,1319,767,734,716,1178,1182,1162,91.3%,88.5%,86.3%,86.9%,3.5%,4.2%,4.1%,3.8%,0.9%,1.2%,1.8%,1.9%,10.5%,13.8%,10%,8.9%,9.1%,12.1%,13.5%,7.3%,35.5%,36.3%,32%,30%,9.1%,6.7%,6.8%,5.6%,80.5%,80.9%,73.1%,82.5%,16.9%,15.7%,16%,16%,75.4%,74.6%,84.9%,65.7%,72.1%,71.5%,63.1%,55.8%,66%,62.9%,59.8%,67.9%,58.6%,72.2%,72.4%,72.9%,74.9%,67.7%,71.3%,31.9%,41.3%,36.1%,42.4%,52.2%,59.5%,53.6%,65%,31%,30.2%,31.4%,29.4%,39.4%,34.1%,32.7%,35.8%,44.2%,41.1%,35.1%,22.7%,21.1%,18.7%,18.7%,2.6%,3%,3.8%,3.8%,82.1%,82.3%,83.9%,83.9%,5.2%,6.5%,6.5%,90.2%\nCherry Hill,833,818,845,830,412,391,420,452,584,547,514,530,778,817,805,370,412,444,507,493,519,97.6%,97.9%,96.9%,96.4%,0.5%,0.8%,1%,1%,0%,0.7%,1.6%,2%,14.3%,21.5%,18.9%,18.7%,17%,19.2%,19.5%,18.4%,44.2%,50.6%,46.7%,44%,10.5%,7.2%,10.5%,10.5%,91.3%,92.3%,88.5%,94.1%,19.6%,17.7%,17.9%,17.7%,68.3%,82.1%,84.8%,69.6%,57.9%,64.7%,72.7%,68.5%,54.1%,56.7%,65.2%,64.3%,52.3%,64.1%,54.3%,67.5%,55.7%,67.3%,61.1%,34%,32.7%,29.7%,32%,54.9%,57%,45.9%,47.2%,29.7%,29.6%,27.2%,26.4%,32%,27.2%,36.4%,25.3%,43.6%,40.7%,37.7%,23.2%,25%,21.9%,21.9%,3.9%,4.9%,3.2%,3.2%,76.4%,85.3%,84.4%,84.4%,8.9%,9.6%,9.6%,86.2%\nChinquapin Park/Belvedere,381,391,388,362,228,216,207,203,351,338,306,307,368,369,352,203,199,196,301,291,299,93.3%,91.7%,90.4%,91.3%,3.6%,4.7%,4.8%,5%,0.4%,2%,2.7%,1.7%,10.5%,12.3%,10.6%,10.5%,9.2%,10.6%,6.3%,12.8%,34.5%,29.6%,31.7%,28.3%,6.5%,7.2%,8%,7.2%,79.6%,75.7%,68.1%,75.3%,15.4%,16.7%,16.6%,15.2%,68.1%,73.1%,84.3%,86.6%,87%,89.4%,77%,82.1%,83.1%,80.6%,71.6%,73.8%,75%,79.5%,79.5%,87.7%,83.8%,83.3%,90.4%,30.3%,37.3%,41.5%,44.4%,42.4%,51.7%,59.7%,66.7%,44.7%,38.1%,31.3%,39.2%,44%,32.7%,35.8%,42%,47.1%,56.2%,60.5%,22.7%,23.6%,14.8%,14.8%,4.3%,2.4%,2.6%,2.6%,76.4%,84.1%,82.4%,82.4%,5.6%,7.3%,7.3%,82.3%\nClaremont/Armistead,538,605,575,671,267,259,274,312,343,356,338,369,548,557,645,234,257,295,309,323,354,58.7%,57.4%,56.2%,57.4%,23.8%,20.9%,19.2%,17.4%,14.4%,18.6%,21.6%,23.2%,14.1%,12.7%,9.9%,11.9%,15.4%,13.9%,12.4%,9%,41.4%,44.7%,42%,38.5%,4.8%,4.8%,3.8%,4.1%,81.9%,86.6%,81%,88.9%,15.6%,13.6%,13.8%,13.8%,77.6%,86.8%,84%,82.9%,86.5%,83.5%,87.9%,57.3%,77.7%,68.7%,78.5%,70.1%,72.6%,75%,83.8%,83.6%,77.9%,77.4%,82.7%,32.6%,43.2%,48.7%,46.7%,56.2%,60.8%,67.6%,66.3%,27.3%,35.9%,32.5%,27.5%,51.9%,46%,38.7%,35%,48.2%,43.1%,47.7%,28.6%,21.6%,22.2%,22.2%,3.2%,1.4%,6.1%,6.1%,80.3%,81.5%,78.4%,78.4%,4.9%,6.4%,6.4%,84.4%\nClifton-Berea,879,787,754,772,523,439,426,421,784,678,588,555,734,734,741,410,420,407,605,577,541,98.2%,98.6%,98.4%,98.4%,0.3%,0.6%,0.7%,0.6%,0.4%,0.5%,0.5%,0.5%,15.4%,23%,16.6%,16.2%,18%,21%,21.6%,16.4%,42.2%,48.5%,51%,43.4%,10.4%,11.3%,10.2%,9%,89.9%,91.9%,82.9%,93%,16.8%,16.3%,15.9%,16.3%,69.4%,78.1%,79%,62.5%,77.7%,57.5%,57.4%,62.5%,67.6%,48.9%,54.7%,64.6%,53.9%,50.7%,51.5%,70.8%,61.7%,52.1%,65.2%,25.2%,33.6%,26.9%,19.8%,42.8%,53.9%,43.9%,47.4%,24.5%,26.1%,23%,17.5%,33.5%,25.8%,29.5%,26.6%,40.2%,34.3%,33.3%,23.1%,20%,20.3%,20.3%,4.6%,5.5%,6%,6%,77.7%,80.8%,81.3%,81.3%,8.9%,9.9%,9.9%,82.5%\nCross-Country/Cheswolde,194,259,254,210,108,140,128,114,124,160,144,140,232,244,200,122,125,104,139,138,127,74.4%,75.2%,79.2%,77.1%,4.9%,8.4%,6.4%,8.4%,4.7%,6.6%,6.8%,7.3%,8.8%,8.1%,5.9%,11%,1.9%,4.3%,6.3%,7%,26.6%,26.3%,22.9%,22.9%,5.9%,3.2%,3.8%,1.3%,56.4%,63.1%,56.8%,64.9%,14.3%,14.1%,14.2%,13.4%,43.9%,70.7%,69.2%,86.4%,83%,81.5%,76.1%,90.9%,84.4%,75.9%,78.3%,66.7%,85.4%,76.2%,73.3%,76.2%,90.2%,90.5%,86.7%,58.3%,54.3%,64.9%,69.2%,72.2%,76.5%,89.5%,78.4%,42.4%,46.2%,43.6%,46.8%,73.1%,53.8%,46.7%,52.9%,63.3%,51.2%,71%,34%,40%,23.5%,23.5%,2.4%,3.1%,0.7%,0.7%,76.9%,80%,75.8%,75.8%,2.9%,3.9%,3.9%,99.2%\nDickeyville/Franklintown,219,233,209,221,124,115,103,110,183,157,150,126,210,187,211,101,97,104,139,147,119,97.5%,97.8%,96.7%,97.2%,0.5%,1%,2%,1.5%,0.5%,0.9%,1.1%,1.1%,10.5%,12.4%,7.7%,10.4%,22.6%,19.1%,10.7%,10.9%,36.1%,38.2%,42%,42.1%,8.9%,7.6%,7.2%,7.2%,81.4%,82%,72.3%,85.6%,9.8%,11.7%,13.3%,14.2%,57.5%,80.9%,84.8%,94.4%,60%,78.6%,89.1%,88.9%,60%,73.8%,87%,73.5%,66.7%,90.3%,74.1%,85.3%,76.9%,83.9%,69.2%,21.3%,26.8%,40%,44.8%,48.9%,70.7%,52%,69%,43.1%,47.6%,32.7%,31%,47.6%,42.2%,33.3%,20.5%,51.1%,48.6%,57.1%,20.5%,22.4%,25%,25%,2.7%,1.3%,2%,2%,78.6%,80%,84.8%,84.8%,6.9%,7.1%,7.1%,100%\nDorchester/Ashburton,578,644,642,618,404,376,340,325,732,656,599,557,607,618,598,352,331,318,599,580,535,97.6%,97.4%,97.1%,97.2%,0.4%,1.2%,0.9%,0.9%,0.2%,0.9%,1.1%,1.2%,11.1%,14%,11.2%,11.5%,9.4%,13.8%,13.2%,9.2%,37%,35.5%,32.1%,30%,9.3%,8.7%,9.2%,7.5%,78.6%,79.2%,73.3%,83.1%,16.4%,15.9%,17.4%,16.9%,40.3%,65%,58.9%,82.1%,73.9%,72.5%,77.3%,78.6%,73%,66.1%,67.6%,71.9%,72.1%,78.7%,66.4%,80.2%,85.6%,79.7%,68.4%,31.4%,38.2%,31.1%,41.2%,60.2%,61.8%,59.1%,59.6%,37.6%,37.9%,29.7%,33.5%,38.7%,32.2%,35.2%,38.1%,50.6%,43.8%,50.5%,21.8%,19.8%,17.2%,17.2%,4.5%,3%,4.1%,4.1%,80.7%,79.3%,81.8%,81.8%,7.7%,9.8%,9.8%,92.1%\nDowntown/Seton Hill,111,78,94,107,45,56,43,47,80,75,72,71,75,86,99,54,42,44,65,69,67,93%,92.2%,89.1%,86.7%,2.2%,2.8%,4.8%,7.1%,1.1%,0.4%,2.4%,2%,8.1%,23.1%,12.8%,14%,22.2%,25%,14%,14.9%,40%,36%,38.9%,40.8%,4.8%,7.5%,8.9%,9.3%,84.4%,86.6%,76.2%,86.3%,17%,18.4%,17.3%,16.9%,70.4%,91.3%,75%,60%,80%,66.7%,61.1%,60%,85%,80%,55.6%,62.5%,77.8%,46.2%,61.1%,79.2%,44.4%,61.5%,52.9%,23.5%,25%,33.3%,47.4%,52.9%,37.5%,55.6%,57.9%,41.2%,45%,53.6%,26.1%,33.3%,43.5%,35%,31%,47.1%,36.8%,44.4%,32.4%,25%,13.8%,13.8%,5%,1.3%,0%,0%,82.4%,90.9%,93.3%,93.3%,6.7%,8.1%,8.1%,82.9%\nEdmondson Village,520,532,494,475,325,341,309,293,614,584,505,483,504,476,462,313,304,288,540,503,469,99%,99%,99.1%,98.9%,0.3%,0.3%,0.2%,0.2%,0.1%,0.5%,0.5%,0.7%,16.7%,17.1%,12.3%,14.5%,38.2%,12.9%,18.4%,14.7%,45.1%,45.5%,42.4%,35.8%,11.8%,9.5%,11.7%,6.2%,86%,84%,79.4%,87.5%,16.9%,16.2%,17.2%,16.9%,77.8%,74.5%,87%,80.8%,54.5%,51%,66.3%,74.7%,53.6%,46.9%,65%,57%,65.6%,63.9%,54.5%,78%,77.1%,71.4%,60.2%,31.7%,31.4%,32%,25.3%,57.4%,52.3%,50%,53%,35.6%,33%,32.1%,22.5%,45.5%,32.8%,35%,33.9%,54.2%,43.3%,56%,22.3%,19.7%,18%,18%,3.1%,3.8%,1.4%,1.4%,77.7%,77%,83.6%,83.6%,7.5%,9.8%,9.8%,97.4%\nFells Point,188,162,184,190,59,54,58,69,100,72,68,84,145,176,186,48,53,66,60,59,77,28.5%,16.2%,15.1%,22.2%,20.5%,26.4%,25.9%,24.8%,43%,51.1%,53.1%,48.2%,6.9%,4.9%,5.4%,6.8%,11.9%,5.6%,13.8%,8.7%,43%,48.6%,44.1%,27.4%,6.2%,4.1%,5.2%,7.3%,73.8%,75.5%,71.6%,75.9%,16.6%,13.7%,15.6%,13.2%,64%,50%,88.7%,87.8%,92.3%,86.1%,77.5%,78%,73.1%,82.9%,77.5%,75.9%,72.7%,84.6%,79.2%,82.8%,90.5%,88.5%,87%,42.9%,42.9%,72.7%,54.5%,76.2%,57.1%,72.7%,81%,41.7%,22.2%,51.9%,35.7%,42.9%,31.3%,66.7%,52.2%,50%,72.2%,66.7%,44.4%,26.7%,31.8%,31.8%,4%,2.8%,8.3%,8.3%,72.2%,92.3%,53.8%,53.8%,3.1%,1.9%,1.9%,90.7%\nForest Park/Walbrook,551,583,548,599,369,330,318,328,603,535,463,510,528,532,566,305,310,314,487,446,485,97.8%,97.8%,97.9%,97.7%,0.5%,0.5%,0.6%,0.6%,0.4%,1.1%,0.9%,1.1%,13.1%,14.8%,8.4%,9.8%,16.3%,17.6%,17%,12.8%,41.1%,43.2%,40%,32.7%,8.1%,9%,9%,9.1%,83.9%,84.2%,76.4%,86.1%,19.9%,18.1%,17.9%,16.3%,70.7%,75.4%,79.6%,83.8%,82.5%,80.4%,75.5%,74.3%,80.6%,79.3%,72.3%,75.3%,75.5%,85.1%,78.8%,85.4%,87.3%,84.3%,76.1%,17.4%,30.1%,32.5%,41.3%,47.1%,63.9%,55.3%,61.5%,39.7%,35.7%,27.4%,35.8%,46.6%,35.9%,37.7%,40%,50%,43.4%,55.1%,25.5%,24.1%,23.5%,23.5%,3.8%,4.1%,4.6%,4.6%,74.1%,76.4%,80.2%,80.2%,6.9%,9.8%,9.8%,78.7%\nGlen-Fallstaff,421,589,548,630,306,333,309,387,506,468,446,493,538,527,598,311,300,343,411,434,472,88.1%,87.6%,86.3%,83.3%,4.3%,3.8%,3.8%,4.5%,2.4%,6.4%,7.9%,10.1%,8.8%,11.5%,7.1%,9.5%,7.8%,9.9%,6.1%,8.5%,30.8%,30.1%,32.1%,27.4%,8.6%,7.2%,7%,5.2%,71.5%,75.9%,69.3%,77.5%,15.2%,15.3%,15.4%,14%,61.5%,67.7%,66.4%,69.3%,74.3%,80.4%,73.6%,69.3%,70.4%,69.1%,67.8%,54.5%,72.2%,69.2%,67%,77.9%,79.6%,81%,77.4%,35%,54.1%,48.5%,55.4%,60.2%,69.6%,63.9%,71.3%,45.2%,42.1%,46.9%,39.5%,49.1%,41.8%,50.7%,43.6%,50%,52%,52.8%,27.7%,31%,17.7%,17.7%,2.2%,3.8%,2.2%,2.2%,79.5%,73.4%,82%,82%,5%,6.1%,6.1%,88.8%\nGreater Charles Village/Barclay,388,359,356,382,214,200,184,204,283,282,269,285,333,346,366,185,180,193,245,258,276,88.5%,84.8%,83.2%,84.2%,5.9%,7.9%,9.3%,8.5%,1.8%,3.5%,4.1%,4.1%,11.6%,14.2%,14.9%,12%,15.4%,13.5%,11.4%,13.7%,44.5%,43.3%,37.2%,36.8%,7.7%,5.9%,5.4%,5.9%,84.2%,83.1%,77.5%,83.5%,17.1%,14.5%,15.2%,14.4%,74%,67.9%,81%,77.3%,73.9%,82%,69.4%,71.1%,58.5%,75%,70.8%,67.1%,71.4%,77.3%,70.5%,78.9%,80.4%,80.3%,85%,44.3%,29.4%,38.5%,48.6%,53.2%,68%,71.2%,72.2%,33.3%,38%,46.2%,38.3%,37.1%,52.2%,49.4%,38.1%,37.3%,53.5%,54.2%,28.3%,24.7%,21.3%,21.3%,3.9%,4.6%,3.2%,3.2%,76.3%,76.9%,77.6%,77.6%,8.6%,10%,10%,99.2%\nGreater Govans,583,649,613,671,381,384,347,372,684,619,555,553,589,599,651,361,338,362,558,518,526,97.3%,97.5%,97%,96.5%,0.6%,1.3%,1.2%,1.8%,0.4%,0.6%,1%,1.1%,11.7%,16%,9.6%,9.4%,12.1%,16.4%,10.1%,9.7%,33.8%,38.9%,35.3%,34.5%,10.1%,8.7%,7.5%,7.1%,81.7%,82.3%,75.5%,85.6%,17.9%,17.8%,16.6%,17.5%,68.4%,85.8%,74.1%,85.7%,75.2%,70.5%,72%,84.8%,68.3%,67.4%,66.9%,67.3%,66.1%,78.5%,68.9%,81.8%,75.6%,76.7%,75.8%,43.4%,36.2%,41%,35.2%,64.3%,61.5%,59.8%,65%,40.4%,35.7%,33.9%,36.8%,40.5%,32.9%,35.8%,34.4%,45.4%,44.9%,36.6%,25.2%,25.8%,30.1%,30.1%,3.7%,4.2%,3.9%,3.9%,83.8%,91%,88.7%,88.7%,7.1%,10.4%,10.4%,83.1%\nGreater Mondawmin,584,549,533,545,352,315,307,297,592,522,478,501,519,517,542,299,301,285,474,465,475,98.2%,98.5%,98.2%,98.6%,0.2%,0.6%,0.8%,0.5%,0%,0.4%,0.5%,0.6%,12.3%,16.8%,10.3%,13.6%,11.6%,20.6%,14%,11.4%,36%,37.9%,32.8%,28.5%,7.5%,9%,8.8%,7%,84.1%,83.8%,76.9%,86.1%,16.3%,15.9%,15.7%,15.6%,75.3%,83.6%,83.6%,80%,75.5%,86.1%,62.6%,69.5%,69.4%,74.3%,58.3%,76.6%,69.5%,76.2%,66.3%,81.9%,73.7%,79.8%,72.4%,27.6%,26.4%,30.2%,31.2%,44.8%,52.3%,55.7%,55.8%,29.6%,35.6%,36.8%,36.5%,38.6%,36.4%,36%,42.3%,37.4%,48.4%,47%,22.6%,24.6%,20.5%,20.5%,3%,4.4%,2.9%,2.9%,80.2%,83.2%,82.4%,82.4%,8%,8.9%,8.9%,76.6%\nGreater Roland Park/Poplar Hill,182,256,234,243,83,98,107,104,54,83,79,74,233,226,228,85,107,97,69,78,75,19.1%,23.1%,20.9%,22.9%,55.5%,59.4%,57.6%,58%,3%,3%,4.5%,4.5%,4.9%,3.9%,3%,2.1%,6%,5.1%,2.8%,3.8%,5.6%,8.4%,6.3%,9.5%,2.1%,1.8%,0.6%,0%,22.7%,15%,13.7%,13.3%,7.2%,6.4%,6.8%,6%,91.3%,85.7%,95.2%,94.9%,97.9%,90%,96.4%,100%,97.8%,92.3%,96.4%,100%,97.6%,96.2%,100%,100%,100%,100%,97.7%,56%,64.3%,92.6%,81.5%,80%,85.2%,92.3%,85.2%,81.8%,83.3%,92.3%,76.5%,94.1%,100%,85.7%,81.8%,87.5%,89.5%,80%,68%,44.4%,50%,50%,0%,1.2%,0%,0%,100%,83.3%,100%,100%,1.4%,1.2%,1.2%,98.8%\nGreater Rosemont,1452,1457,1444,1418,788,779,804,813,1343,1201,1131,1088,1374,1410,1382,727,780,786,1083,1103,1055,98.7%,98.7%,98.2%,98.4%,0.3%,0.5%,0.6%,0.5%,0.1%,0.6%,0.9%,0.9%,12.6%,16.8%,11.1%,12.8%,22.1%,15.8%,13.7%,11.8%,43.4%,49%,48.2%,38.2%,9.4%,7.9%,8%,6.8%,88.9%,88.8%,82.2%,91.3%,19.2%,18%,18.1%,16.7%,75%,75.3%,77.5%,77.1%,66.5%,66.9%,51.4%,71.2%,69.3%,57.3%,53.5%,70.2%,56.5%,66.6%,59.8%,82.4%,77.3%,67.6%,73%,28.1%,31.6%,29.4%,34.7%,49.8%,56%,53.2%,58.2%,37.9%,32.3%,27.6%,27%,38.4%,28.9%,33.6%,30.4%,46.7%,42.2%,38.4%,22.6%,21%,21.1%,21.1%,4.5%,4.2%,5.3%,5.3%,77%,78%,82.5%,82.5%,8.8%,10.3%,10.3%,90.3%\nGreenmount East,584,529,537,580,438,350,318,315,627,583,520,490,499,529,568,325,320,304,532,486,470,97.9%,98.6%,98.4%,97.9%,0.5%,0.4%,0.4%,0.7%,0.2%,0.3%,0.5%,0.7%,14.7%,21.6%,20.1%,14.5%,23.7%,20.9%,18.9%,14.6%,47.7%,49.1%,51%,44.3%,11.9%,10.7%,12.9%,10.4%,90.2%,89.5%,82.6%,92.3%,19.9%,18.8%,18.3%,19.9%,73.5%,64%,80.3%,73.7%,67.4%,70.4%,61.4%,64.9%,71.6%,57.4%,60.4%,67.6%,59.8%,62.8%,57.9%,72.2%,72.4%,71.6%,75.8%,26.7%,29.1%,27%,29.4%,48.1%,49.4%,51.5%,51.4%,27.8%,22.6%,30%,29%,34.5%,28.9%,33.8%,29.3%,41.2%,38.9%,29.4%,24%,22.7%,20.1%,20.1%,4.1%,5.8%,4.9%,4.9%,74.1%,72.9%,83.3%,83.3%,8.4%,9.3%,9.3%,91.3%\nHamilton,670,713,636,572,427,454,404,397,638,604,569,518,641,618,548,408,401,385,555,542,498,86.4%,85.9%,85.8%,86.5%,9.1%,10.4%,10.1%,10.1%,1.9%,1.7%,1.9%,1.5%,7.9%,13.7%,9.9%,9.6%,10.1%,11.9%,11.9%,9.8%,30.6%,29.3%,27.8%,23.7%,8.8%,7.8%,7.9%,5.9%,74%,73.2%,67%,73.3%,16.4%,15.2%,16%,15.9%,75%,63.9%,69.2%,74%,70.9%,79.7%,67.2%,76.4%,72%,75.2%,67.2%,68%,64.3%,70.2%,68.6%,82.3%,84.4%,76.6%,83.3%,40.8%,34.8%,51.8%,41.2%,65.8%,69.3%,63.3%,73.9%,50.8%,50%,38.7%,44.7%,55.2%,39.6%,42.6%,45.9%,52.6%,56.9%,60.7%,29.9%,30.1%,21.8%,21.8%,4.1%,3.3%,2.1%,2.1%,77.4%,81.4%,79.3%,79.3%,5.8%,5.5%,5.5%,94.3%\nHarbor East/Little Italy,381,344,354,402,155,161,153,172,206,209,194,199,332,347,396,154,151,169,182,178,186,93.7%,93.7%,93.3%,91.4%,1%,1.6%,1.4%,1.1%,2.6%,3.6%,3.5%,6.8%,14.2%,16.6%,12.4%,20.6%,17.4%,18%,15%,14%,40.8%,50.2%,47.9%,36.2%,6.5%,7.1%,6.9%,6.1%,91.4%,92.4%,86.1%,94.8%,17.1%,17%,20.1%,18.4%,59.3%,86.4%,40.3%,82.5%,74.7%,77.6%,70%,69.8%,54.9%,60.3%,71.7%,63.6%,72%,80.7%,51.4%,70.9%,72%,80.7%,63%,21.1%,44.7%,32.6%,33.3%,34.2%,63%,54.4%,64.6%,33.3%,35.6%,25.5%,29.5%,38%,26.5%,22.6%,33.8%,52.7%,38.7%,29.6%,22%,14.1%,16.3%,16.3%,4.9%,7.7%,7%,7%,66.7%,82.4%,70.7%,70.7%,5.6%,8.8%,8.8%,60.2%\nHarford/Echodale,805,828,770,789,493,503,451,429,679,634,602,581,740,738,771,464,447,418,572,557,564,83%,84.5%,84.3%,84.4%,12.6%,11.2%,11.5%,11.2%,2.6%,2.8%,2.9%,3.3%,10.8%,11.7%,7.7%,9.4%,10.1%,13.1%,10%,9.3%,28%,28.5%,27.1%,23.4%,5.4%,7.1%,6%,6.1%,72.1%,71.2%,68%,77.3%,17.4%,18.4%,17%,18%,78.8%,82.9%,81.2%,81.6%,75.7%,77.6%,72.6%,73.5%,73.6%,70.2%,68.7%,74.2%,73.2%,79.3%,69.2%,83.9%,85%,86.1%,78.9%,44.2%,38.4%,52.3%,50%,63.9%,72%,73.2%,68.3%,47.9%,53.4%,49.2%,43.9%,45.8%,48.6%,51.1%,48.9%,60.7%,57.1%,53.3%,35.4%,24.7%,25.3%,25.3%,2.7%,3%,1.1%,1.1%,84.1%,84%,86%,86%,5.4%,5.9%,5.9%,83.3%\nHighlandtown,239,257,267,299,109,117,135,127,133,136,117,139,231,254,286,106,126,123,119,109,125,33.9%,28.2%,25.8%,25.2%,27%,25.5%,23.6%,23.2%,34.5%,41.4%,45.1%,48%,10.5%,14.8%,10.1%,11.7%,19.3%,21.4%,15.6%,11.8%,51.1%,53.7%,51.3%,43.2%,7.5%,5.9%,6.2%,5.3%,83.2%,84%,78.2%,84.4%,15%,11.9%,11.8%,11.5%,72.9%,66.7%,71.9%,77.5%,73.9%,71.4%,66.7%,77.5%,64.4%,63.8%,65%,71.8%,66.7%,63.4%,63.4%,71.8%,81.1%,75.6%,74.4%,41.5%,35.7%,44.4%,52.3%,73.2%,60.7%,70.6%,68.2%,36.4%,31.1%,25.6%,28.6%,41.9%,41.7%,22.9%,39.5%,33.3%,43.9%,22.2%,33.9%,35.7%,12.8%,12.8%,4.5%,2.9%,10.3%,10.3%,61.9%,74.3%,75%,75%,8%,6.4%,6.4%,87.3%\nHoward Park/West Arlington,492,527,438,490,314,282,270,256,519,484,403,418,467,422,471,253,256,246,437,385,403,95.7%,96.5%,96.2%,96%,0.6%,1%,0.8%,0.8%,0.9%,1.5%,1.9%,2%,6.5%,9.9%,10.3%,12%,11.5%,13.8%,15.2%,14.1%,37.2%,32.2%,29%,26.6%,8.5%,7.2%,8%,6.5%,77.1%,78.5%,70%,81.1%,17.1%,15.4%,15.3%,15.9%,59.8%,71.3%,89.2%,86.5%,83.3%,85.9%,74%,82%,76.3%,77.5%,72%,82.1%,67.3%,55.8%,54.6%,91.7%,76.2%,79.2%,74.2%,31.5%,34.8%,38.6%,39%,55.4%,58%,60%,71.3%,38.2%,43.8%,37.7%,31.4%,49.7%,50%,37.3%,43.1%,49.7%,45.5%,46.4%,25%,20.4%,23.6%,23.6%,3.7%,2.5%,2.9%,2.9%,83.6%,78.8%,79.8%,79.8%,6.8%,6.5%,6.5%,96.6%\nInner Harbor/Federal Hill,210,231,236,226,92,68,91,76,127,107,93,92,201,222,218,65,87,75,97,91,86,48.5%,38.8%,42.3%,43.3%,41.4%,49.6%,46.5%,47.8%,4.7%,5.6%,5.2%,3.9%,9%,11.3%,7.6%,7.5%,17.4%,11.8%,13.2%,15.8%,38.6%,42.1%,43%,34.8%,6.3%,4.1%,6.4%,8.6%,69.4%,70.3%,58.3%,61%,20.3%,15.7%,14.7%,13%,75.8%,89.1%,90%,80.6%,83.3%,86.5%,91.4%,96.8%,83.3%,84.6%,94.3%,75%,62.9%,58.8%,78.3%,90%,85.7%,73.5%,91.3%,76.7%,46.2%,43.8%,53.3%,76.7%,61.5%,53.1%,60%,28.3%,36.1%,34.4%,37%,32.6%,50%,13%,41.7%,59.1%,44%,71.4%,36.7%,17.9%,17.4%,17.4%,3.9%,3.7%,3.2%,3.2%,72.7%,70.6%,73.1%,73.1%,5.4%,6.8%,6.8%,96.3%\nLauraville,560,597,528,597,364,333,352,357,647,540,477,506,561,511,574,300,335,346,494,453,488,87.7%,84.3%,83.7%,84.5%,8.2%,11.1%,11.4%,11.6%,1.6%,1.7%,1.8%,2%,9.6%,14.7%,7.6%,8%,11.3%,10.2%,10.8%,9.5%,31.7%,30.7%,32.9%,29.6%,6.7%,7%,7%,6.1%,72.1%,70.5%,65.7%,74.7%,19.9%,16.5%,16.6%,16.5%,71.7%,78.6%,62.5%,84.9%,77.7%,76.8%,72.2%,81.7%,76.7%,73.7%,73%,68.4%,70.5%,69.5%,72.4%,73.4%,79.6%,87.6%,78.1%,34.5%,38.5%,55.3%,42.6%,53.8%,74.7%,64.1%,71.8%,40.5%,44.1%,38.7%,40.6%,41.8%,37.3%,43.4%,43.4%,42.1%,50.9%,52.9%,25.1%,23.3%,22.5%,22.5%,2.8%,2.4%,2.1%,2.1%,73.9%,80.3%,80.5%,80.5%,6.5%,7.2%,7.2%,94.9%\nLoch Raven,793,946,913,916,549,480,421,407,758,741,704,696,872,873,894,437,416,399,676,662,676,96.6%,97.3%,97.3%,97.3%,0.8%,0.8%,0.5%,0.4%,0.2%,0.6%,1%,1%,6.6%,10.6%,7.2%,7.1%,8.4%,9.6%,8.8%,5.7%,31.4%,28.7%,22.6%,21.7%,7.5%,7.1%,8.3%,6.3%,75.3%,73.7%,68.8%,76.5%,14%,13.6%,15%,14.8%,61.1%,73.1%,78.3%,85.9%,83.6%,84.2%,78.1%,83%,83.1%,81.3%,75.9%,80.7%,81.3%,81.1%,

In [4]:
re.findall('drop',data)

['drop', 'drop', 'drop', 'drop']

# Pandas

In [1]:
import pandas as pd

In [2]:
students=[{'Name':'Kirti', 'Subject':'Data Science','Score':'90'},
         {'Name':'Divyansh','Subject':'Maths','Score':'90'},
         {'Name':'Khush','Subject':'English','Score':'70'}]
df=pd.DataFrame(students,index=['s1','s2','s3'])
df

        Name       Subject Score
s1     Kirti  Data Science    90
s2  Divyansh         Maths    90
s3     Khush       English    70

In [3]:
df.loc['s2']

Name       Divyansh
Subject       Maths
Score            90
Name: s2, dtype: object

In [4]:
type(df.loc['s2'])

pandas.core.series.Series

In [5]:
df.iloc[2]

Name         Khush
Subject    English
Score           70
Name: s3, dtype: object

In [6]:
df.loc['s1']

Name              Kirti
Subject    Data Science
Score                90
Name: s1, dtype: object

In [7]:
df.T.loc['Name']

s1       Kirti
s2    Divyansh
s3       Khush
Name: Name, dtype: object

In [8]:
df.loc[:,['Name','Score']]

        Name Score
s1     Kirti    90
s2  Divyansh    90
s3     Khush    70

In [9]:
df.drop('s3')

        Name       Subject Score
s1     Kirti  Data Science    90
s2  Divyansh         Maths    90

In [10]:
df

        Name       Subject Score
s1     Kirti  Data Science    90
s2  Divyansh         Maths    90
s3     Khush       English    70

In [11]:
copy_df=df.copy()
copy_df.drop('Score',inplace=True,axis=1)
copy_df

        Name       Subject
s1     Kirti  Data Science
s2  Divyansh         Maths
s3     Khush       English

In [12]:
df['ClassRanking']=None
df

        Name       Subject Score ClassRanking
s1     Kirti  Data Science    90         None
s2  Divyansh         Maths    90         None
s3     Khush       English    70         None

# Admission Predict

In [13]:
df=pd.read_csv('/home/kirti/Data_sets/Admission_Predict.csv')
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [14]:
new_df=df.rename(mapper=str.strip,axis='columns')
new_df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [15]:
df=df.rename(columns={'SOP':'Statement of purpose','LOR ':'Letter of recommendation'})
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,Statement of purpose,Letter of recommendation,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [16]:
cols=list(df.columns)
cols=[x.lower().strip() for x in cols]
df.columns=cols
df.head()

,serial no.,gre score,toefl score,university rating,statement of purpose,letter of recommendation,cgpa,research,chance of admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [17]:
chance_mask=df['chance of admit']>0.7
chance_mask

0       True
1       True
2       True
3       True
4      False
       ...
395     True
396     True
397     True
398    False
399     True
Name: chance of admit, Length: 400, dtype: bool

In [18]:
df.where(chance_mask)

,serial no.,gre score,toefl score,university rating,statement of purpose,letter of recommendation,cgpa,research,chance of admit
0,1.0,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
1,2.0,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
2,3.0,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
3,4.0,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
395,396.0,324.0,110.0,3.0,3.5,3.5,9.04,1.0,0.82
396,397.0,325.0,107.0,3.0,3.0,3.5,9.11,1.0,0.84
397,398.0,330.0,116.0,4.0,5.0,4.5,9.45,1.0,0.91
398,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
399,400.0,333.0,117.0,4.0,5.0,4.0,9.66,1.0,0.95

In [19]:
df.where(chance_mask).dropna()

,serial no.,gre score,toefl score,university rating,statement of purpose,letter of recommendation,cgpa,research,chance of admit
0,1.0,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
1,2.0,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
2,3.0,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
3,4.0,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
5,6.0,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90
...,...,...,...,...,...,...,...,...,...
394,395.0,329.0,111.0,4.0,4.5,4.0,9.23,1.0,0.89
395,396.0,324.0,110.0,3.0,3.5,3.5,9.04,1.0,0.82
396,397.0,325.0,107.0,3.0,3.0,3.5,9.11,1.0,0.84
397,398.0,330.0,116.0,4.0,5.0,4.5,9.45,1.0,0.91
399,400.0,333.0,117.0,4.0,5.0,4.0,9.66,1.0,0.95

In [20]:
df[['gre score','toefl score']].head()

   gre score  toefl score
0        337          118
1        324          107
2        316          104
3        322          110
4        314          103

In [21]:
df[df['gre score']>320].head()

,serial no.,gre score,toefl score,university rating,statement of purpose,letter of recommendation,cgpa,research,chance of admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
3,4,322,110,3,3.5,2.5,8.67,1,0.80
5,6,330,115,5,4.5,3.0,9.34,1,0.90
6,7,321,109,3,3.0,4.0,8.20,1,0.75

In [22]:
(df['chance of admit']>0.7) & (df['chance of admit']<0.9)

0      False
1       True
2       True
3       True
4      False
       ...
395     True
396     True
397    False
398    False
399    False
Name: chance of admit, Length: 400, dtype: bool

# Census

In [23]:
df=pd.read_csv('/home/kirti/Data_sets/census.csv')
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [24]:
df['SUMLEV'].unique()

array([40, 50])

In [25]:
df[df['SUMLEV']==50].head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861
5,50,3,6,1,9,Alabama,Blount County,57322,57322,57373,...,1.807375,-1.177622,-1.748766,-2.062535,-1.369970,1.859511,-0.848580,-1.402476,-1.577232,-0.884411

In [26]:
columns_to_keep=['STNAME','CTYNAME','BIRTHS2010','BIRTHS2011','BIRTHS2012','BIRTHS2013','BIRTHS2014','BIRTHS2015','POPESTIMATE2010',
                'POPESTIMATE2011','POPESTIMATE2012','POPESTIMATE2013','POPESTIMATE2014','POPESTIMATE2015']
df=df[columns_to_keep]
df

,STNAME,CTYNAME,BIRTHS2010,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
0,Alabama,Alabama,14226,59689,59062,57938,58334,58305,4785161,4801108,4816089,4830533,4846411,4858979
1,Alabama,Autauga County,151,636,615,574,623,600,54660,55253,55175,55038,55290,55347
2,Alabama,Baldwin County,517,2187,2092,2160,2186,2240,183193,186659,190396,195126,199713,203709
3,Alabama,Barbour County,70,335,300,283,260,269,27341,27226,27159,26973,26815,26489
4,Alabama,Bibb County,44,266,245,259,247,253,22861,22733,22642,22512,22549,22583
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3188,Wyoming,Sweetwater County,167,640,595,657,629,620,43593,44041,45104,45162,44925,44626
3189,Wyoming,Teton County,76,259,230,261,249,269,21297,21482,21697,22347,22905,23125
3190,Wyoming,Uinta County,73,324,311,316,316,316,21102,20912,20989,21022,20903,20822
3191,Wyoming,Washakie County,26,108,90,95,96,90,8545,8469,8443,8443,8316,8328
3192,Wyoming,Weston County,26,81,74,93,77,79,7181,7114,7065,7160,7185,7234

# Class Grades

In [28]:
df=pd.read_csv('/home/kirti/Data_sets/class_grades.csv')
df.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17      NaN     63.15  48.89
3       7         NaN       NaN    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [29]:
df.isnull()

    Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0    False       False     False    False     False  False
1    False       False     False    False     False  False
2    False       False     False     True     False  False
3    False        True      True    False     False  False
4    False       False     False    False     False  False
..     ...         ...       ...      ...       ...    ...
94   False        True     False    False     False  False
95   False        True     False    False     False  False
96   False       False     False    False     False  False
97   False       False     False    False     False  False
98   False       False     False    False     False  False

[99 rows x 6 columns]

In [36]:
df.dropna().head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17     0.00     63.15  48.89
3       7        0.00      0.00    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [37]:
df.fillna(0,inplace=True)
df

    Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0        5       57.14     34.09    64.38     51.48  52.50
1        8       95.05    105.49    67.50     99.07  68.33
2        8       83.70     83.17     0.00     63.15  48.89
3        7        0.00      0.00    49.38    105.93  80.56
4        8       91.32     93.64    95.00    107.41  73.89
..     ...         ...       ...      ...       ...    ...
94       8        0.00    103.71    45.00     93.52  61.94
95       7        0.00     80.54    41.25     93.70  39.72
96       8       89.94    102.77    87.50     90.74  87.78
97       7       95.60     76.13    66.25     99.81  85.56
98       8       63.40     97.37    73.12     72.78  77.22

[99 rows x 6 columns]

# Log data /html pages

In [38]:
df=pd.read_csv('/home/kirti/Data_sets/log.csv')
df

          time    user          video  playback position paused  volume
0   1469974424  cheryl     intro.html                  5  False    10.0
1   1469974454  cheryl     intro.html                  6    NaN     NaN
2   1469974544  cheryl     intro.html                  9    NaN     NaN
3   1469974574  cheryl     intro.html                 10    NaN     NaN
4   1469977514     bob     intro.html                  1    NaN     NaN
5   1469977544     bob     intro.html                  1    NaN     NaN
6   1469977574     bob     intro.html                  1    NaN     NaN
7   1469977604     bob     intro.html                  1    NaN     NaN
8   1469974604  cheryl     intro.html                 11    NaN     NaN
9   1469974694  cheryl     intro.html                 14    NaN     NaN
10  1469974724  cheryl     intro.html                 15    NaN     NaN
11  1469974454     sue  advanced.html                 24    NaN     NaN
12  1469974524     sue  advanced.html                 25    NaN     NaN
13  1469974424     sue  advanced.html                 23  False    10.0
14  1469974554     sue  advanced.html                 26    NaN     NaN
15  1469974624     sue  advanced.html                 27    NaN     NaN
16  1469974654     sue  advanced.html                 28    NaN     5.0
17  1469974724     sue  advanced.html                 29    NaN     NaN
18  1469974484  cheryl     intro.html                  7    NaN     NaN
19  1469974514  cheryl     intro.html                  8    NaN     NaN
20  1469974754     sue  advanced.html                 30    NaN     NaN
21  1469974824     sue  advanced.html                 31    NaN     NaN
22  1469974854     sue  advanced.html                 32    NaN     NaN
23  1469974924     sue  advanced.html                 33    NaN     NaN
24  1469977424     bob     intro.html                  1   True    10.0
25  1469977454     bob     intro.html                  1    NaN     NaN
26  1469977484     bob     intro.html                  1    NaN     NaN
27  1469977634     bob     intro.html                  1    NaN     NaN
28  1469977664     bob     intro.html                  1    NaN     NaN
29  1469974634  cheryl     intro.html                 12    NaN     NaN
30  1469974664  cheryl     intro.html                 13    NaN     NaN
31  1469977694     bob     intro.html                  1    NaN     NaN
32  1469977724     bob     intro.html                  1    NaN     NaN

In [41]:
df.set_index('time')
df=df.sort_index()
df.head(10)

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN
5  1469977544     bob  intro.html                  1    NaN     NaN
6  1469977574     bob  intro.html                  1    NaN     NaN
7  1469977604     bob  intro.html                  1    NaN     NaN
8  1469974604  cheryl  intro.html                 11    NaN     NaN
9  1469974694  cheryl  intro.html                 14    NaN     NaN

In [42]:
df=df.reset_index()
df=df.set_index(['time','user'])
df.head(10)

                   index       video  playback position paused  volume
time       user
1469974424 cheryl      0  intro.html                  5  False    10.0
1469974454 cheryl      1  intro.html                  6    NaN     NaN
1469974544 cheryl      2  intro.html                  9    NaN     NaN
1469974574 cheryl      3  intro.html                 10    NaN     NaN
1469977514 bob         4  intro.html                  1    NaN     NaN
1469977544 bob         5  intro.html                  1    NaN     NaN
1469977574 bob         6  intro.html                  1    NaN     NaN
1469977604 bob         7  intro.html                  1    NaN     NaN
1469974604 cheryl      8  intro.html                 11    NaN     NaN
1469974694 cheryl      9  intro.html                 14    NaN     NaN

In [43]:
df=pd.read_csv('/home/kirti/Data_sets/log.csv')
df

          time    user          video  playback position paused  volume
0   1469974424  cheryl     intro.html                  5  False    10.0
1   1469974454  cheryl     intro.html                  6    NaN     NaN
2   1469974544  cheryl     intro.html                  9    NaN     NaN
3   1469974574  cheryl     intro.html                 10    NaN     NaN
4   1469977514     bob     intro.html                  1    NaN     NaN
5   1469977544     bob     intro.html                  1    NaN     NaN
6   1469977574     bob     intro.html                  1    NaN     NaN
7   1469977604     bob     intro.html                  1    NaN     NaN
8   1469974604  cheryl     intro.html                 11    NaN     NaN
9   1469974694  cheryl     intro.html                 14    NaN     NaN
10  1469974724  cheryl     intro.html                 15    NaN     NaN
11  1469974454     sue  advanced.html                 24    NaN     NaN
12  1469974524     sue  advanced.html                 25    NaN     NaN
13  1469974424     sue  advanced.html                 23  False    10.0
14  1469974554     sue  advanced.html                 26    NaN     NaN
15  1469974624     sue  advanced.html                 27    NaN     NaN
16  1469974654     sue  advanced.html                 28    NaN     5.0
17  1469974724     sue  advanced.html                 29    NaN     NaN
18  1469974484  cheryl     intro.html                  7    NaN     NaN
19  1469974514  cheryl     intro.html                  8    NaN     NaN
20  1469974754     sue  advanced.html                 30    NaN     NaN
21  1469974824     sue  advanced.html                 31    NaN     NaN
22  1469974854     sue  advanced.html                 32    NaN     NaN
23  1469974924     sue  advanced.html                 33    NaN     NaN
24  1469977424     bob     intro.html                  1   True    10.0
25  1469977454     bob     intro.html                  1    NaN     NaN
26  1469977484     bob     intro.html                  1    NaN     NaN
27  1469977634     bob     intro.html                  1    NaN     NaN
28  1469977664     bob     intro.html                  1    NaN     NaN
29  1469974634  cheryl     intro.html                 12    NaN     NaN
30  1469974664  cheryl     intro.html                 13    NaN     NaN
31  1469977694     bob     intro.html                  1    NaN     NaN
32  1469977724     bob     intro.html                  1    NaN     NaN

In [46]:
df.replace(to_replace=".*.html$", value="webpage",regex=True)

          time    user    video  playback position paused  volume
0   1469974424  cheryl  webpage                  5  False    10.0
1   1469974454  cheryl  webpage                  6    NaN     NaN
2   1469974544  cheryl  webpage                  9    NaN     NaN
3   1469974574  cheryl  webpage                 10    NaN     NaN
4   1469977514     bob  webpage                  1    NaN     NaN
5   1469977544     bob  webpage                  1    NaN     NaN
6   1469977574     bob  webpage                  1    NaN     NaN
7   1469977604     bob  webpage                  1    NaN     NaN
8   1469974604  cheryl  webpage                 11    NaN     NaN
9   1469974694  cheryl  webpage                 14    NaN     NaN
10  1469974724  cheryl  webpage                 15    NaN     NaN
11  1469974454     sue  webpage                 24    NaN     NaN
12  1469974524     sue  webpage                 25    NaN     NaN
13  1469974424     sue  webpage                 23  False    10.0
14  1469974554     sue  webpage                 26    NaN     NaN
15  1469974624     sue  webpage                 27    NaN     NaN
16  1469974654     sue  webpage                 28    NaN     5.0
17  1469974724     sue  webpage                 29    NaN     NaN
18  1469974484  cheryl  webpage                  7    NaN     NaN
19  1469974514  cheryl  webpage                  8    NaN     NaN
20  1469974754     sue  webpage                 30    NaN     NaN
21  1469974824     sue  webpage                 31    NaN     NaN
22  1469974854     sue  webpage                 32    NaN     NaN
23  1469974924     sue  webpage                 33    NaN     NaN
24  1469977424     bob  webpage                  1   True    10.0
25  1469977454     bob  webpage                  1    NaN     NaN
26  1469977484     bob  webpage                  1    NaN     NaN
27  1469977634     bob  webpage                  1    NaN     NaN
28  1469977664     bob  webpage                  1    NaN     NaN
29  1469974634  cheryl  webpage                 12    NaN     NaN
30  1469974664  cheryl  webpage                 13    NaN     NaN
31  1469977694     bob  webpage                  1    NaN     NaN
32  1469977724     bob  webpage                  1    NaN     NaN

In [7]:
df=pd.read_csv('/home/kirti/Data_sets/presidents.csv')
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57years, 67daysApr 30, 1789","65years, 10daysMar 4, 1797","2years, 285days","Dec 14, 1799","67years, 295days"
1,2,John Adams,"Oct 30, 1735[a]","61years, 125daysMar 4, 1797","65years, 125daysMar 4, 1801","25years, 122days","Jul 4, 1826","90years, 247days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57years, 325daysMar 4, 1801","65years, 325daysMar 4, 1809","17years, 122days","Jul 4, 1826","83years, 82days"
3,4,James Madison,"Mar 16, 1751[a]","57years, 353daysMar 4, 1809","65years, 353daysMar 4, 1817","19years, 116days","Jun 28, 1836","85years, 104days"
4,5,James Monroe,"Apr 28, 1758","58years, 310daysMar 4, 1817","66years, 310daysMar 4, 1825","6years, 122days","Jul 4, 1831","73years, 67days"

In [8]:

df['First']=df['President']

df['First']=df['First'].replace('[ ].*','',regex=True)
df.head(10)

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First
0,1,George Washington,"Feb 22, 1732[a]","57years, 67daysApr 30, 1789","65years, 10daysMar 4, 1797","2years, 285days","Dec 14, 1799","67years, 295days",George
1,2,John Adams,"Oct 30, 1735[a]","61years, 125daysMar 4, 1797","65years, 125daysMar 4, 1801","25years, 122days","Jul 4, 1826","90years, 247days",John
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57years, 325daysMar 4, 1801","65years, 325daysMar 4, 1809","17years, 122days","Jul 4, 1826","83years, 82days",Thomas
3,4,James Madison,"Mar 16, 1751[a]","57years, 353daysMar 4, 1809","65years, 353daysMar 4, 1817","19years, 116days","Jun 28, 1836","85years, 104days",James
4,5,James Monroe,"Apr 28, 1758","58years, 310daysMar 4, 1817","66years, 310daysMar 4, 1825","6years, 122days","Jul 4, 1831","73years, 67days",James
5,6,John Quincy Adams,"Jul 11, 1767","57years, 236daysMar 4, 1825","61years, 236daysMar 4, 1829","18years, 356days","Feb 23, 1848","80years, 227days",John
6,7,Andrew Jackson,"Mar 15, 1767","61years, 354daysMar 4, 1829","69years, 354daysMar 4, 1837","8years, 96days","Jun 8, 1845","78years, 85days",Andrew
7,8,Martin Van Buren,"Dec 5, 1782","54years, 89daysMar 4, 1837","58years, 89daysMar 4, 1841","21years, 142days","Jul 24, 1862","79years, 231days",Martin
8,9,William H. Harrison,"Feb 9, 1773","68years, 23daysMar 4, 1841","68years, 54days Apr 4, 1841[b]",NaN,"Apr 4, 1841","68years, 54days",William
9,10,John Tyler,"Mar 29, 1790","51years, 6daysApr 4, 1841","54years, 340daysMar 4, 1845","16years, 320days","Jan 18, 1862","71years, 295days",John

In [9]:
del(df['First'])

def splitname(row):
    row['First']=row['President'].split(' ')[0]
    row['Last']=row['President'].split(' ')[-1]
    return row
df=df.apply(splitname, axis='columns')
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,Last
0,1,George Washington,"Feb 22, 1732[a]","57years, 67daysApr 30, 1789","65years, 10daysMar 4, 1797","2years, 285days","Dec 14, 1799","67years, 295days",George,Washington
1,2,John Adams,"Oct 30, 1735[a]","61years, 125daysMar 4, 1797","65years, 125daysMar 4, 1801","25years, 122days","Jul 4, 1826","90years, 247days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57years, 325daysMar 4, 1801","65years, 325daysMar 4, 1809","17years, 122days","Jul 4, 1826","83years, 82days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751[a]","57years, 353daysMar 4, 1809","65years, 353daysMar 4, 1817","19years, 116days","Jun 28, 1836","85years, 104days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58years, 310daysMar 4, 1817","66years, 310daysMar 4, 1825","6years, 122days","Jul 4, 1831","73years, 67days",James,Monroe

In [12]:
del(df['First'])
del(df['Last'])
pattern='(^[\w]*)(?:.* )([\w]*$)'
df['President'].str.extract(pattern).head()

KeyError: 'First'

In [13]:
df['Born']=df['Born'].str.extract('([\w]{3} [\w]{1,2}, [\w]{4})')
df['Born'].head()

0    Feb 22, 1732
1    Oct 30, 1735
2    Apr 13, 1743
3    Mar 16, 1751
4    Apr 28, 1758
Name: Born, dtype: object

In [16]:
df['Born']=pd.to_datetime(df['Born'])
df['Born'].head()

0   1732-02-22
1   1735-10-30
2   1743-04-13
3   1751-03-16
4   1758-04-28
Name: Born, dtype: datetime64[ns]

In [18]:
df[['age1','end2']] = df['Age atend of presidency'].str.split("days", expand=True)
df['age1'] += 'days'
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,age1,end2
0,1,George Washington,1732-02-22,"57years, 67daysApr 30, 1789","65years, 10daysMar 4, 1797","2years, 285days","Dec 14, 1799","67years, 295days","65years, 10days","Mar 4, 1797"
1,2,John Adams,1735-10-30,"61years, 125daysMar 4, 1797","65years, 125daysMar 4, 1801","25years, 122days","Jul 4, 1826","90years, 247days","65years, 125days","Mar 4, 1801"
2,3,Thomas Jefferson,1743-04-13,"57years, 325daysMar 4, 1801","65years, 325daysMar 4, 1809","17years, 122days","Jul 4, 1826","83years, 82days","65years, 325days","Mar 4, 1809"
3,4,James Madison,1751-03-16,"57years, 353daysMar 4, 1809","65years, 353daysMar 4, 1817","19years, 116days","Jun 28, 1836","85years, 104days","65years, 353days","Mar 4, 1817"
4,5,James Monroe,1758-04-28,"58years, 310daysMar 4, 1817","66years, 310daysMar 4, 1825","6years, 122days","Jul 4, 1831","73years, 67days","66years, 310days","Mar 4, 1825"